app/views/home/index.html.erb

SELECT  "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "Kyle"], ["LIMIT", 1]]
---

<!-- <%= user2 = User.find_by(:username => "Kyle"); %> -->