app/controllers/home_controller.rb

SELECT  "users".* FROM "users" LIMIT $1  [["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
def index
  @users = User.all
  @user2 = User.find_by(params[:id]);
  if params[:upvote]
    @user = User.find(params[:upvote])