app/controllers/pictures_controller.rb

SELECT  "pictures".* FROM "pictures" WHERE "pictures"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "pictures" SET "task_id" = $1, "updated_at" = $2 WHERE "pictures"."id" = $3  [["task_id", 269751931], ["updated_at", 2017-03-01 00:44:34 UTC], ["id", 1]]
---
def show
  @picture = Picture.find(params[:id])
   @task_id = @picture.get_task
   @picture.update(:task_id => @task_id)

INSERT INTO "pictures" ("title", "description", "url", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "aeg"], ["description", "agr"], ["url", "agrw"], ["created_at", 2017-02-28 23:41:23 UTC], ["updated_at", 2017-02-28 23:41:23 UTC]]
---
def create
   @user = current_user
   @picture = Picture.new(picture_params)
   if @picture.save